grevaillot/svd_tools/headers/ATSAM3X8H/can0.h
#pragma once 

/* --- CAN0: Controller Area Network 0 ------------------------------ */

/** @defgroup can0_registers Controller Area Network 0 Register
@{*/

/** CAN0_MR Mode Register **/
#define CAN0_MR			MMIO32(CAN0_BASE + 0x00)
/** CAN0_IER Interrupt Enable Register **/
#define CAN0_IER			MMIO32(CAN0_BASE + 0x04)
/** CAN0_IDR Interrupt Disable Register **/
#define CAN0_IDR			MMIO32(CAN0_BASE + 0x08)
/** CAN0_IMR Interrupt Mask Register **/
#define CAN0_IMR			MMIO32(CAN0_BASE + 0x0c)
/** CAN0_SR Status Register **/
#define CAN0_SR			MMIO32(CAN0_BASE + 0x10)
/** CAN0_BR Baudrate Register **/
#define CAN0_BR			MMIO32(CAN0_BASE + 0x14)
/** CAN0_TIM Timer Register **/
#define CAN0_TIM			MMIO32(CAN0_BASE + 0x18)
/** CAN0_TIMESTP Timestamp Register **/
#define CAN0_TIMESTP			MMIO32(CAN0_BASE + 0x1c)
/** CAN0_ECR Error Counter Register **/
#define CAN0_ECR			MMIO32(CAN0_BASE + 0x20)
/** CAN0_TCR Transfer Command Register **/
#define CAN0_TCR			MMIO32(CAN0_BASE + 0x24)
/** CAN0_ACR Abort Command Register **/
#define CAN0_ACR			MMIO32(CAN0_BASE + 0x28)
/** CAN0_WPMR Write Protect Mode Register **/
#define CAN0_WPMR			MMIO32(CAN0_BASE + 0xe4)
/** CAN0_WPSR Write Protect Status Register **/
#define CAN0_WPSR			MMIO32(CAN0_BASE + 0xe8)
/** CAN0_MMR0 Mailbox Mode Register (MB = 0) **/
#define CAN0_MMR0			MMIO32(CAN0_BASE + 0x200)
/** CAN0_MAM0 Mailbox Acceptance Mask Register (MB = 0) **/
#define CAN0_MAM0			MMIO32(CAN0_BASE + 0x204)
/** CAN0_MID0 Mailbox ID Register (MB = 0) **/
#define CAN0_MID0			MMIO32(CAN0_BASE + 0x208)
/** CAN0_MFID0 Mailbox Family ID Register (MB = 0) **/
#define CAN0_MFID0			MMIO32(CAN0_BASE + 0x20c)
/** CAN0_MSR0 Mailbox Status Register (MB = 0) **/
#define CAN0_MSR0			MMIO32(CAN0_BASE + 0x210)
/** CAN0_MDL0 Mailbox Data Low Register (MB = 0) **/
#define CAN0_MDL0			MMIO32(CAN0_BASE + 0x214)
/** CAN0_MDH0 Mailbox Data High Register (MB = 0) **/
#define CAN0_MDH0			MMIO32(CAN0_BASE + 0x218)
/** CAN0_MCR0 Mailbox Control Register (MB = 0) **/
#define CAN0_MCR0			MMIO32(CAN0_BASE + 0x21c)
/** CAN0_MMR1 Mailbox Mode Register (MB = 1) **/
#define CAN0_MMR1			MMIO32(CAN0_BASE + 0x220)
/** CAN0_MAM1 Mailbox Acceptance Mask Register (MB = 1) **/
#define CAN0_MAM1			MMIO32(CAN0_BASE + 0x224)
/** CAN0_MID1 Mailbox ID Register (MB = 1) **/
#define CAN0_MID1			MMIO32(CAN0_BASE + 0x228)
/** CAN0_MFID1 Mailbox Family ID Register (MB = 1) **/
#define CAN0_MFID1			MMIO32(CAN0_BASE + 0x22c)
/** CAN0_MSR1 Mailbox Status Register (MB = 1) **/
#define CAN0_MSR1			MMIO32(CAN0_BASE + 0x230)
/** CAN0_MDL1 Mailbox Data Low Register (MB = 1) **/
#define CAN0_MDL1			MMIO32(CAN0_BASE + 0x234)
/** CAN0_MDH1 Mailbox Data High Register (MB = 1) **/
#define CAN0_MDH1			MMIO32(CAN0_BASE + 0x238)
/** CAN0_MCR1 Mailbox Control Register (MB = 1) **/
#define CAN0_MCR1			MMIO32(CAN0_BASE + 0x23c)
/** CAN0_MMR2 Mailbox Mode Register (MB = 2) **/
#define CAN0_MMR2			MMIO32(CAN0_BASE + 0x240)
/** CAN0_MAM2 Mailbox Acceptance Mask Register (MB = 2) **/
#define CAN0_MAM2			MMIO32(CAN0_BASE + 0x244)
/** CAN0_MID2 Mailbox ID Register (MB = 2) **/
#define CAN0_MID2			MMIO32(CAN0_BASE + 0x248)
/** CAN0_MFID2 Mailbox Family ID Register (MB = 2) **/
#define CAN0_MFID2			MMIO32(CAN0_BASE + 0x24c)
/** CAN0_MSR2 Mailbox Status Register (MB = 2) **/
#define CAN0_MSR2			MMIO32(CAN0_BASE + 0x250)
/** CAN0_MDL2 Mailbox Data Low Register (MB = 2) **/
#define CAN0_MDL2			MMIO32(CAN0_BASE + 0x254)
/** CAN0_MDH2 Mailbox Data High Register (MB = 2) **/
#define CAN0_MDH2			MMIO32(CAN0_BASE + 0x258)
/** CAN0_MCR2 Mailbox Control Register (MB = 2) **/
#define CAN0_MCR2			MMIO32(CAN0_BASE + 0x25c)
/** CAN0_MMR3 Mailbox Mode Register (MB = 3) **/
#define CAN0_MMR3			MMIO32(CAN0_BASE + 0x260)
/** CAN0_MAM3 Mailbox Acceptance Mask Register (MB = 3) **/
#define CAN0_MAM3			MMIO32(CAN0_BASE + 0x264)
/** CAN0_MID3 Mailbox ID Register (MB = 3) **/
#define CAN0_MID3			MMIO32(CAN0_BASE + 0x268)
/** CAN0_MFID3 Mailbox Family ID Register (MB = 3) **/
#define CAN0_MFID3			MMIO32(CAN0_BASE + 0x26c)
/** CAN0_MSR3 Mailbox Status Register (MB = 3) **/
#define CAN0_MSR3			MMIO32(CAN0_BASE + 0x270)
/** CAN0_MDL3 Mailbox Data Low Register (MB = 3) **/
#define CAN0_MDL3			MMIO32(CAN0_BASE + 0x274)
/** CAN0_MDH3 Mailbox Data High Register (MB = 3) **/
#define CAN0_MDH3			MMIO32(CAN0_BASE + 0x278)
/** CAN0_MCR3 Mailbox Control Register (MB = 3) **/
#define CAN0_MCR3			MMIO32(CAN0_BASE + 0x27c)
/** CAN0_MMR4 Mailbox Mode Register (MB = 4) **/
#define CAN0_MMR4			MMIO32(CAN0_BASE + 0x280)
/** CAN0_MAM4 Mailbox Acceptance Mask Register (MB = 4) **/
#define CAN0_MAM4			MMIO32(CAN0_BASE + 0x284)
/** CAN0_MID4 Mailbox ID Register (MB = 4) **/
#define CAN0_MID4			MMIO32(CAN0_BASE + 0x288)
/** CAN0_MFID4 Mailbox Family ID Register (MB = 4) **/
#define CAN0_MFID4			MMIO32(CAN0_BASE + 0x28c)
/** CAN0_MSR4 Mailbox Status Register (MB = 4) **/
#define CAN0_MSR4			MMIO32(CAN0_BASE + 0x290)
/** CAN0_MDL4 Mailbox Data Low Register (MB = 4) **/
#define CAN0_MDL4			MMIO32(CAN0_BASE + 0x294)
/** CAN0_MDH4 Mailbox Data High Register (MB = 4) **/
#define CAN0_MDH4			MMIO32(CAN0_BASE + 0x298)
/** CAN0_MCR4 Mailbox Control Register (MB = 4) **/
#define CAN0_MCR4			MMIO32(CAN0_BASE + 0x29c)
/** CAN0_MMR5 Mailbox Mode Register (MB = 5) **/
#define CAN0_MMR5			MMIO32(CAN0_BASE + 0x2a0)
/** CAN0_MAM5 Mailbox Acceptance Mask Register (MB = 5) **/
#define CAN0_MAM5			MMIO32(CAN0_BASE + 0x2a4)
/** CAN0_MID5 Mailbox ID Register (MB = 5) **/
#define CAN0_MID5			MMIO32(CAN0_BASE + 0x2a8)
/** CAN0_MFID5 Mailbox Family ID Register (MB = 5) **/
#define CAN0_MFID5			MMIO32(CAN0_BASE + 0x2ac)
/** CAN0_MSR5 Mailbox Status Register (MB = 5) **/
#define CAN0_MSR5			MMIO32(CAN0_BASE + 0x2b0)
/** CAN0_MDL5 Mailbox Data Low Register (MB = 5) **/
#define CAN0_MDL5			MMIO32(CAN0_BASE + 0x2b4)
/** CAN0_MDH5 Mailbox Data High Register (MB = 5) **/
#define CAN0_MDH5			MMIO32(CAN0_BASE + 0x2b8)
/** CAN0_MCR5 Mailbox Control Register (MB = 5) **/
#define CAN0_MCR5			MMIO32(CAN0_BASE + 0x2bc)
/** CAN0_MMR6 Mailbox Mode Register (MB = 6) **/
#define CAN0_MMR6			MMIO32(CAN0_BASE + 0x2c0)
/** CAN0_MAM6 Mailbox Acceptance Mask Register (MB = 6) **/
#define CAN0_MAM6			MMIO32(CAN0_BASE + 0x2c4)
/** CAN0_MID6 Mailbox ID Register (MB = 6) **/
#define CAN0_MID6			MMIO32(CAN0_BASE + 0x2c8)
/** CAN0_MFID6 Mailbox Family ID Register (MB = 6) **/
#define CAN0_MFID6			MMIO32(CAN0_BASE + 0x2cc)
/** CAN0_MSR6 Mailbox Status Register (MB = 6) **/
#define CAN0_MSR6			MMIO32(CAN0_BASE + 0x2d0)
/** CAN0_MDL6 Mailbox Data Low Register (MB = 6) **/
#define CAN0_MDL6			MMIO32(CAN0_BASE + 0x2d4)
/** CAN0_MDH6 Mailbox Data High Register (MB = 6) **/
#define CAN0_MDH6			MMIO32(CAN0_BASE + 0x2d8)
/** CAN0_MCR6 Mailbox Control Register (MB = 6) **/
#define CAN0_MCR6			MMIO32(CAN0_BASE + 0x2dc)
/** CAN0_MMR7 Mailbox Mode Register (MB = 7) **/
#define CAN0_MMR7			MMIO32(CAN0_BASE + 0x2e0)
/** CAN0_MAM7 Mailbox Acceptance Mask Register (MB = 7) **/
#define CAN0_MAM7			MMIO32(CAN0_BASE + 0x2e4)
/** CAN0_MID7 Mailbox ID Register (MB = 7) **/
#define CAN0_MID7			MMIO32(CAN0_BASE + 0x2e8)
/** CAN0_MFID7 Mailbox Family ID Register (MB = 7) **/
#define CAN0_MFID7			MMIO32(CAN0_BASE + 0x2ec)
/** CAN0_MSR7 Mailbox Status Register (MB = 7) **/
#define CAN0_MSR7			MMIO32(CAN0_BASE + 0x2f0)
/** CAN0_MDL7 Mailbox Data Low Register (MB = 7) **/
#define CAN0_MDL7			MMIO32(CAN0_BASE + 0x2f4)
/** CAN0_MDH7 Mailbox Data High Register (MB = 7) **/
#define CAN0_MDH7			MMIO32(CAN0_BASE + 0x2f8)
/** CAN0_MCR7 Mailbox Control Register (MB = 7) **/
#define CAN0_MCR7			MMIO32(CAN0_BASE + 0x2fc)

/**@}*/


/** @defgroup can0_mr MR Mode Register
@{*/


#define CAN0_MR_RXSYNC_SHIFT		24
#define CAN0_MR_RXSYNC_MASK		0x07
/** @defgroup can0_mr_rxsync RXSYNC Reception Synchronization Stage (not readable)
@{*/
/**@}*/

/** CAN0_MR_DRPT Disable Repeat **/
#define CAN0_MR_DRPT		(1 << 7)
/** CAN0_MR_TIMFRZ Enable Timer Freeze **/
#define CAN0_MR_TIMFRZ		(1 << 6)
/** CAN0_MR_TTM Disable/Enable Time Triggered Mode **/
#define CAN0_MR_TTM		(1 << 5)
/** CAN0_MR_TEOF Timestamp messages at each end of Frame **/
#define CAN0_MR_TEOF		(1 << 4)
/** CAN0_MR_OVL Disable/Enable Overload Frame **/
#define CAN0_MR_OVL		(1 << 3)
/** CAN0_MR_ABM Disable/Enable Autobaud/Listen mode **/
#define CAN0_MR_ABM		(1 << 2)
/** CAN0_MR_LPM Disable/Enable Low Power Mode **/
#define CAN0_MR_LPM		(1 << 1)
/** CAN0_MR_CANEN CAN Controller Enable **/
#define CAN0_MR_CANEN		(1 << 0)

/**@}*/

/** @defgroup can0_ier IER Interrupt Enable Register
@{*/

/** CAN0_IER_BERR Bit Error Interrupt Enable **/
#define CAN0_IER_BERR		(1 << 28)
/** CAN0_IER_FERR Form Error Interrupt Enable **/
#define CAN0_IER_FERR		(1 << 27)
/** CAN0_IER_AERR Acknowledgment Error Interrupt Enable **/
#define CAN0_IER_AERR		(1 << 26)
/** CAN0_IER_SERR Stuffing Error Interrupt Enable **/
#define CAN0_IER_SERR		(1 << 25)
/** CAN0_IER_CERR CRC Error Interrupt Enable **/
#define CAN0_IER_CERR		(1 << 24)
/** CAN0_IER_TSTP TimeStamp Interrupt Enable **/
#define CAN0_IER_TSTP		(1 << 23)
/** CAN0_IER_TOVF Timer Overflow Interrupt Enable **/
#define CAN0_IER_TOVF		(1 << 22)
/** CAN0_IER_WAKEUP Wakeup Interrupt Enable **/
#define CAN0_IER_WAKEUP		(1 << 21)
/** CAN0_IER_SLEEP Sleep Interrupt Enable **/
#define CAN0_IER_SLEEP		(1 << 20)
/** CAN0_IER_BOFF Bus Off Mode Interrupt Enable **/
#define CAN0_IER_BOFF		(1 << 19)
/** CAN0_IER_ERRP Error Passive Mode Interrupt Enable **/
#define CAN0_IER_ERRP		(1 << 18)
/** CAN0_IER_WARN Warning Limit Interrupt Enable **/
#define CAN0_IER_WARN		(1 << 17)
/** CAN0_IER_ERRA Error Active Mode Interrupt Enable **/
#define CAN0_IER_ERRA		(1 << 16)
/** CAN0_IER_MB7 Mailbox 7 Interrupt Enable **/
#define CAN0_IER_MB7		(1 << 7)
/** CAN0_IER_MB6 Mailbox 6 Interrupt Enable **/
#define CAN0_IER_MB6		(1 << 6)
/** CAN0_IER_MB5 Mailbox 5 Interrupt Enable **/
#define CAN0_IER_MB5		(1 << 5)
/** CAN0_IER_MB4 Mailbox 4 Interrupt Enable **/
#define CAN0_IER_MB4		(1 << 4)
/** CAN0_IER_MB3 Mailbox 3 Interrupt Enable **/
#define CAN0_IER_MB3		(1 << 3)
/** CAN0_IER_MB2 Mailbox 2 Interrupt Enable **/
#define CAN0_IER_MB2		(1 << 2)
/** CAN0_IER_MB1 Mailbox 1 Interrupt Enable **/
#define CAN0_IER_MB1		(1 << 1)
/** CAN0_IER_MB0 Mailbox 0 Interrupt Enable **/
#define CAN0_IER_MB0		(1 << 0)

/**@}*/

