grevaillot/svd_tools/headers/ATSAM3X8H/can0.h
/** @defgroup can0_idr IDR Interrupt Disable Register
@{*/

/** CAN0_IDR_BERR Bit Error Interrupt Disable **/
#define CAN0_IDR_BERR		(1 << 28)
/** CAN0_IDR_FERR Form Error Interrupt Disable **/
#define CAN0_IDR_FERR		(1 << 27)
/** CAN0_IDR_AERR Acknowledgment Error Interrupt Disable **/
#define CAN0_IDR_AERR		(1 << 26)
/** CAN0_IDR_SERR Stuffing Error Interrupt Disable **/
#define CAN0_IDR_SERR		(1 << 25)
/** CAN0_IDR_CERR CRC Error Interrupt Disable **/
#define CAN0_IDR_CERR		(1 << 24)
/** CAN0_IDR_TSTP TimeStamp Interrupt Disable **/
#define CAN0_IDR_TSTP		(1 << 23)
/** CAN0_IDR_TOVF Timer Overflow Interrupt **/
#define CAN0_IDR_TOVF		(1 << 22)
/** CAN0_IDR_WAKEUP Wakeup Interrupt Disable **/
#define CAN0_IDR_WAKEUP		(1 << 21)
/** CAN0_IDR_SLEEP Sleep Interrupt Disable **/
#define CAN0_IDR_SLEEP		(1 << 20)
/** CAN0_IDR_BOFF Bus Off Mode Interrupt Disable **/
#define CAN0_IDR_BOFF		(1 << 19)
/** CAN0_IDR_ERRP Error Passive Mode Interrupt Disable **/
#define CAN0_IDR_ERRP		(1 << 18)
/** CAN0_IDR_WARN Warning Limit Interrupt Disable **/
#define CAN0_IDR_WARN		(1 << 17)
/** CAN0_IDR_ERRA Error Active Mode Interrupt Disable **/
#define CAN0_IDR_ERRA		(1 << 16)
/** CAN0_IDR_MB7 Mailbox 7 Interrupt Disable **/
#define CAN0_IDR_MB7		(1 << 7)
/** CAN0_IDR_MB6 Mailbox 6 Interrupt Disable **/
#define CAN0_IDR_MB6		(1 << 6)
/** CAN0_IDR_MB5 Mailbox 5 Interrupt Disable **/
#define CAN0_IDR_MB5		(1 << 5)
/** CAN0_IDR_MB4 Mailbox 4 Interrupt Disable **/
#define CAN0_IDR_MB4		(1 << 4)
/** CAN0_IDR_MB3 Mailbox 3 Interrupt Disable **/
#define CAN0_IDR_MB3		(1 << 3)
/** CAN0_IDR_MB2 Mailbox 2 Interrupt Disable **/
#define CAN0_IDR_MB2		(1 << 2)
/** CAN0_IDR_MB1 Mailbox 1 Interrupt Disable **/
#define CAN0_IDR_MB1		(1 << 1)
/** CAN0_IDR_MB0 Mailbox 0 Interrupt Disable **/
#define CAN0_IDR_MB0		(1 << 0)

/**@}*/

/** @defgroup can0_imr IMR Interrupt Mask Register
@{*/

/** CAN0_IMR_BERR Bit Error Interrupt Mask **/
#define CAN0_IMR_BERR		(1 << 28)
/** CAN0_IMR_FERR Form Error Interrupt Mask **/
#define CAN0_IMR_FERR		(1 << 27)
/** CAN0_IMR_AERR Acknowledgment Error Interrupt Mask **/
#define CAN0_IMR_AERR		(1 << 26)
/** CAN0_IMR_SERR Stuffing Error Interrupt Mask **/
#define CAN0_IMR_SERR		(1 << 25)
/** CAN0_IMR_CERR CRC Error Interrupt Mask **/
#define CAN0_IMR_CERR		(1 << 24)
/** CAN0_IMR_TSTP Timestamp Interrupt Mask **/
#define CAN0_IMR_TSTP		(1 << 23)
/** CAN0_IMR_TOVF Timer Overflow Interrupt Mask **/
#define CAN0_IMR_TOVF		(1 << 22)
/** CAN0_IMR_WAKEUP Wakeup Interrupt Mask **/
#define CAN0_IMR_WAKEUP		(1 << 21)
/** CAN0_IMR_SLEEP Sleep Interrupt Mask **/
#define CAN0_IMR_SLEEP		(1 << 20)
/** CAN0_IMR_BOFF Bus Off Mode Interrupt Mask **/
#define CAN0_IMR_BOFF		(1 << 19)
/** CAN0_IMR_ERRP Error Passive Mode Interrupt Mask **/
#define CAN0_IMR_ERRP		(1 << 18)
/** CAN0_IMR_WARN Warning Limit Interrupt Mask **/
#define CAN0_IMR_WARN		(1 << 17)
/** CAN0_IMR_ERRA Error Active Mode Interrupt Mask **/
#define CAN0_IMR_ERRA		(1 << 16)
/** CAN0_IMR_MB7 Mailbox 7 Interrupt Mask **/
#define CAN0_IMR_MB7		(1 << 7)
/** CAN0_IMR_MB6 Mailbox 6 Interrupt Mask **/
#define CAN0_IMR_MB6		(1 << 6)
/** CAN0_IMR_MB5 Mailbox 5 Interrupt Mask **/
#define CAN0_IMR_MB5		(1 << 5)
/** CAN0_IMR_MB4 Mailbox 4 Interrupt Mask **/
#define CAN0_IMR_MB4		(1 << 4)
/** CAN0_IMR_MB3 Mailbox 3 Interrupt Mask **/
#define CAN0_IMR_MB3		(1 << 3)
/** CAN0_IMR_MB2 Mailbox 2 Interrupt Mask **/
#define CAN0_IMR_MB2		(1 << 2)
/** CAN0_IMR_MB1 Mailbox 1 Interrupt Mask **/
#define CAN0_IMR_MB1		(1 << 1)
/** CAN0_IMR_MB0 Mailbox 0 Interrupt Mask **/
#define CAN0_IMR_MB0		(1 << 0)

/**@}*/

/** @defgroup can0_sr SR Status Register
@{*/

/** CAN0_SR_OVLSY Overload busy **/
#define CAN0_SR_OVLSY		(1 << 31)
/** CAN0_SR_TBSY Transmitter busy **/
#define CAN0_SR_TBSY		(1 << 30)
/** CAN0_SR_RBSY Receiver busy **/
#define CAN0_SR_RBSY		(1 << 29)
/** CAN0_SR_BERR Bit Error **/
#define CAN0_SR_BERR		(1 << 28)
/** CAN0_SR_FERR Form Error **/
#define CAN0_SR_FERR		(1 << 27)
/** CAN0_SR_AERR Acknowledgment Error **/
#define CAN0_SR_AERR		(1 << 26)
/** CAN0_SR_SERR Mailbox Stuffing Error **/
#define CAN0_SR_SERR		(1 << 25)
/** CAN0_SR_CERR Mailbox CRC Error **/
#define CAN0_SR_CERR		(1 << 24)
/** CAN0_SR_TSTP  **/
#define CAN0_SR_TSTP		(1 << 23)
/** CAN0_SR_TOVF Timer Overflow **/
#define CAN0_SR_TOVF		(1 << 22)
/** CAN0_SR_WAKEUP CAN controller is not in Low power Mode **/
#define CAN0_SR_WAKEUP		(1 << 21)
/** CAN0_SR_SLEEP CAN controller in Low power Mode **/
#define CAN0_SR_SLEEP		(1 << 20)
/** CAN0_SR_BOFF Bus Off Mode **/
#define CAN0_SR_BOFF		(1 << 19)
/** CAN0_SR_ERRP Error Passive Mode **/
#define CAN0_SR_ERRP		(1 << 18)
/** CAN0_SR_WARN Warning Limit **/
#define CAN0_SR_WARN		(1 << 17)
/** CAN0_SR_ERRA Error Active Mode **/
#define CAN0_SR_ERRA		(1 << 16)
/** CAN0_SR_MB7 Mailbox 7 Event **/
#define CAN0_SR_MB7		(1 << 7)
/** CAN0_SR_MB6 Mailbox 6 Event **/
#define CAN0_SR_MB6		(1 << 6)
/** CAN0_SR_MB5 Mailbox 5 Event **/
#define CAN0_SR_MB5		(1 << 5)
/** CAN0_SR_MB4 Mailbox 4 Event **/
#define CAN0_SR_MB4		(1 << 4)
/** CAN0_SR_MB3 Mailbox 3 Event **/
#define CAN0_SR_MB3		(1 << 3)
/** CAN0_SR_MB2 Mailbox 2 Event **/
#define CAN0_SR_MB2		(1 << 2)
/** CAN0_SR_MB1 Mailbox 1 Event **/
#define CAN0_SR_MB1		(1 << 1)
/** CAN0_SR_MB0 Mailbox 0 Event **/
#define CAN0_SR_MB0		(1 << 0)

/**@}*/

/** @defgroup can0_br BR Baudrate Register
@{*/

/** CAN0_BR_SMP Sampling Mode **/
#define CAN0_BR_SMP		(1 << 24)

#define CAN0_BR_BRP_SHIFT		16
#define CAN0_BR_BRP_MASK		0x7f
/** @defgroup can0_br_brp BRP Baudrate Prescaler.
@{*/
/**@}*/


#define CAN0_BR_SJW_SHIFT		12
#define CAN0_BR_SJW_MASK		0x03
/** @defgroup can0_br_sjw SJW Re-synchronization jump width
@{*/
/**@}*/


#define CAN0_BR_PROPAG_SHIFT		8
#define CAN0_BR_PROPAG_MASK		0x07
/** @defgroup can0_br_propag PROPAG Programming time segment
@{*/
/**@}*/


#define CAN0_BR_PHASE1_SHIFT		4
#define CAN0_BR_PHASE1_MASK		0x07
/** @defgroup can0_br_phase1 PHASE1 Phase 1 segment
@{*/
/**@}*/


#define CAN0_BR_PHASE2_SHIFT		0
#define CAN0_BR_PHASE2_MASK		0x07
/** @defgroup can0_br_phase2 PHASE2 Phase 2 segment
@{*/
/**@}*/


/**@}*/

