grevaillot/svd_tools/headers/ATSAM3X8H/can0.h
/** @defgroup can0_tim TIM Timer Register
@{*/


#define CAN0_TIM_TIMER_SHIFT		0
#define CAN0_TIM_TIMER_MASK		0xffff
/** @defgroup can0_tim_timer TIMER Timer
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_timestp TIMESTP Timestamp Register
@{*/


#define CAN0_TIMESTP_MTIMESTAMP_SHIFT		0
#define CAN0_TIMESTP_MTIMESTAMP_MASK		0xffff
/** @defgroup can0_timestp_mtimestamp MTIMESTAMP Timestamp
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_ecr ECR Error Counter Register
@{*/


#define CAN0_ECR_TEC_SHIFT		16
#define CAN0_ECR_TEC_MASK		0xff
/** @defgroup can0_ecr_tec TEC Transmit Error Counter
@{*/
/**@}*/


#define CAN0_ECR_REC_SHIFT		0
#define CAN0_ECR_REC_MASK		0xff
/** @defgroup can0_ecr_rec REC Receive Error Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_tcr TCR Transfer Command Register
@{*/

/** CAN0_TCR_TIMRST Timer Reset **/
#define CAN0_TCR_TIMRST		(1 << 31)
/** CAN0_TCR_MB7 Transfer Request for Mailbox 7 **/
#define CAN0_TCR_MB7		(1 << 7)
/** CAN0_TCR_MB6 Transfer Request for Mailbox 6 **/
#define CAN0_TCR_MB6		(1 << 6)
/** CAN0_TCR_MB5 Transfer Request for Mailbox 5 **/
#define CAN0_TCR_MB5		(1 << 5)
/** CAN0_TCR_MB4 Transfer Request for Mailbox 4 **/
#define CAN0_TCR_MB4		(1 << 4)
/** CAN0_TCR_MB3 Transfer Request for Mailbox 3 **/
#define CAN0_TCR_MB3		(1 << 3)
/** CAN0_TCR_MB2 Transfer Request for Mailbox 2 **/
#define CAN0_TCR_MB2		(1 << 2)
/** CAN0_TCR_MB1 Transfer Request for Mailbox 1 **/
#define CAN0_TCR_MB1		(1 << 1)
/** CAN0_TCR_MB0 Transfer Request for Mailbox 0 **/
#define CAN0_TCR_MB0		(1 << 0)

/**@}*/

/** @defgroup can0_acr ACR Abort Command Register
@{*/

/** CAN0_ACR_MB7 Abort Request for Mailbox 7 **/
#define CAN0_ACR_MB7		(1 << 7)
/** CAN0_ACR_MB6 Abort Request for Mailbox 6 **/
#define CAN0_ACR_MB6		(1 << 6)
/** CAN0_ACR_MB5 Abort Request for Mailbox 5 **/
#define CAN0_ACR_MB5		(1 << 5)
/** CAN0_ACR_MB4 Abort Request for Mailbox 4 **/
#define CAN0_ACR_MB4		(1 << 4)
/** CAN0_ACR_MB3 Abort Request for Mailbox 3 **/
#define CAN0_ACR_MB3		(1 << 3)
/** CAN0_ACR_MB2 Abort Request for Mailbox 2 **/
#define CAN0_ACR_MB2		(1 << 2)
/** CAN0_ACR_MB1 Abort Request for Mailbox 1 **/
#define CAN0_ACR_MB1		(1 << 1)
/** CAN0_ACR_MB0 Abort Request for Mailbox 0 **/
#define CAN0_ACR_MB0		(1 << 0)

/**@}*/

/** @defgroup can0_wpmr WPMR Write Protect Mode Register
@{*/


#define CAN0_WPMR_WPKEY_SHIFT		8
#define CAN0_WPMR_WPKEY_MASK		0xffffff
/** @defgroup can0_wpmr_wpkey WPKEY SPI Write Protection Key Password
@{*/
/**@}*/

/** CAN0_WPMR_WPEN Write Protection Enable **/
#define CAN0_WPMR_WPEN		(1 << 0)

/**@}*/

/** @defgroup can0_wpsr WPSR Write Protect Status Register
@{*/


#define CAN0_WPSR_WPVSRC_SHIFT		8
#define CAN0_WPSR_WPVSRC_MASK		0xff
/** @defgroup can0_wpsr_wpvsrc WPVSRC Write Protection Violation Source
@{*/
/**@}*/

/** CAN0_WPSR_WPVS Write Protection Violation Status **/
#define CAN0_WPSR_WPVS		(1 << 0)

/**@}*/

/** @defgroup can0_mmr0 MMR0 Mailbox Mode Register (MB = 0)
@{*/


#define CAN0_MMR0_MOT_SHIFT		24
#define CAN0_MMR0_MOT_MASK		0x07
/** @defgroup can0_mmr0_mot MOT Mailbox Object Type
@{*/
/**@}*/


#define CAN0_MMR0_PRIOR_SHIFT		16
#define CAN0_MMR0_PRIOR_MASK		0x0f
/** @defgroup can0_mmr0_prior PRIOR Mailbox Priority
@{*/
/**@}*/


#define CAN0_MMR0_MTIMEMARK_SHIFT		0
#define CAN0_MMR0_MTIMEMARK_MASK		0xffff
/** @defgroup can0_mmr0_mtimemark MTIMEMARK Mailbox Timemark
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mam0 MAM0 Mailbox Acceptance Mask Register (MB = 0)
@{*/

/** CAN0_MAM0_MIDE Identifier Version **/
#define CAN0_MAM0_MIDE		(1 << 29)

#define CAN0_MAM0_MIDvA_SHIFT		18
#define CAN0_MAM0_MIDvA_MASK		0x7ff
/** @defgroup can0_mam0_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN0_MAM0_MIDvB_SHIFT		0
#define CAN0_MAM0_MIDvB_MASK		0x3ffff
/** @defgroup can0_mam0_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mid0 MID0 Mailbox ID Register (MB = 0)
@{*/

/** CAN0_MID0_MIDE Identifier Version **/
#define CAN0_MID0_MIDE		(1 << 29)

#define CAN0_MID0_MIDvA_SHIFT		18
#define CAN0_MID0_MIDvA_MASK		0x7ff
/** @defgroup can0_mid0_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN0_MID0_MIDvB_SHIFT		0
#define CAN0_MID0_MIDvB_MASK		0x3ffff
/** @defgroup can0_mid0_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mfid0 MFID0 Mailbox Family ID Register (MB = 0)
@{*/


#define CAN0_MFID0_MFID_SHIFT		0
#define CAN0_MFID0_MFID_MASK		0x1fffffff
/** @defgroup can0_mfid0_mfid MFID Family ID
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_msr0 MSR0 Mailbox Status Register (MB = 0)
@{*/

/** CAN0_MSR0_MMI Mailbox Message Ignored **/
#define CAN0_MSR0_MMI		(1 << 24)
/** CAN0_MSR0_MRDY Mailbox Ready **/
#define CAN0_MSR0_MRDY		(1 << 23)
/** CAN0_MSR0_MABT Mailbox Message Abort **/
#define CAN0_MSR0_MABT		(1 << 22)
/** CAN0_MSR0_MRTR Mailbox Remote Transmission Request **/
#define CAN0_MSR0_MRTR		(1 << 20)

#define CAN0_MSR0_MDLC_SHIFT		16
#define CAN0_MSR0_MDLC_MASK		0x0f
/** @defgroup can0_msr0_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


#define CAN0_MSR0_MTIMESTAMP_SHIFT		0
#define CAN0_MSR0_MTIMESTAMP_MASK		0xffff
/** @defgroup can0_msr0_mtimestamp MTIMESTAMP Timer value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mdl0 MDL0 Mailbox Data Low Register (MB = 0)
@{*/


#define CAN0_MDL0_MDL_SHIFT		0
#define CAN0_MDL0_MDL_MASK		0xffffffff
/** @defgroup can0_mdl0_mdl MDL Message Data Low Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mdh0 MDH0 Mailbox Data High Register (MB = 0)
@{*/


#define CAN0_MDH0_MDH_SHIFT		0
#define CAN0_MDH0_MDH_MASK		0xffffffff
/** @defgroup can0_mdh0_mdh MDH Message Data High Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mcr0 MCR0 Mailbox Control Register (MB = 0)
@{*/

/** CAN0_MCR0_MTCR Mailbox Transfer Command **/
#define CAN0_MCR0_MTCR		(1 << 23)
/** CAN0_MCR0_MACR Abort Request for Mailbox x **/
#define CAN0_MCR0_MACR		(1 << 22)
/** CAN0_MCR0_MRTR Mailbox Remote Transmission Request **/
#define CAN0_MCR0_MRTR		(1 << 20)

