grevaillot/svd_tools/headers/ATSAM3X8H/can0.h
#define CAN0_MCR0_MDLC_SHIFT		16
#define CAN0_MCR0_MDLC_MASK		0x0f
/** @defgroup can0_mcr0_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mmr1 MMR1 Mailbox Mode Register (MB = 1)
@{*/


#define CAN0_MMR1_MOT_SHIFT		24
#define CAN0_MMR1_MOT_MASK		0x07
/** @defgroup can0_mmr1_mot MOT Mailbox Object Type
@{*/
/**@}*/


#define CAN0_MMR1_PRIOR_SHIFT		16
#define CAN0_MMR1_PRIOR_MASK		0x0f
/** @defgroup can0_mmr1_prior PRIOR Mailbox Priority
@{*/
/**@}*/


#define CAN0_MMR1_MTIMEMARK_SHIFT		0
#define CAN0_MMR1_MTIMEMARK_MASK		0xffff
/** @defgroup can0_mmr1_mtimemark MTIMEMARK Mailbox Timemark
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mam1 MAM1 Mailbox Acceptance Mask Register (MB = 1)
@{*/

/** CAN0_MAM1_MIDE Identifier Version **/
#define CAN0_MAM1_MIDE		(1 << 29)

#define CAN0_MAM1_MIDvA_SHIFT		18
#define CAN0_MAM1_MIDvA_MASK		0x7ff
/** @defgroup can0_mam1_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN0_MAM1_MIDvB_SHIFT		0
#define CAN0_MAM1_MIDvB_MASK		0x3ffff
/** @defgroup can0_mam1_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mid1 MID1 Mailbox ID Register (MB = 1)
@{*/

/** CAN0_MID1_MIDE Identifier Version **/
#define CAN0_MID1_MIDE		(1 << 29)

#define CAN0_MID1_MIDvA_SHIFT		18
#define CAN0_MID1_MIDvA_MASK		0x7ff
/** @defgroup can0_mid1_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN0_MID1_MIDvB_SHIFT		0
#define CAN0_MID1_MIDvB_MASK		0x3ffff
/** @defgroup can0_mid1_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mfid1 MFID1 Mailbox Family ID Register (MB = 1)
@{*/


#define CAN0_MFID1_MFID_SHIFT		0
#define CAN0_MFID1_MFID_MASK		0x1fffffff
/** @defgroup can0_mfid1_mfid MFID Family ID
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_msr1 MSR1 Mailbox Status Register (MB = 1)
@{*/

/** CAN0_MSR1_MMI Mailbox Message Ignored **/
#define CAN0_MSR1_MMI		(1 << 24)
/** CAN0_MSR1_MRDY Mailbox Ready **/
#define CAN0_MSR1_MRDY		(1 << 23)
/** CAN0_MSR1_MABT Mailbox Message Abort **/
#define CAN0_MSR1_MABT		(1 << 22)
/** CAN0_MSR1_MRTR Mailbox Remote Transmission Request **/
#define CAN0_MSR1_MRTR		(1 << 20)

#define CAN0_MSR1_MDLC_SHIFT		16
#define CAN0_MSR1_MDLC_MASK		0x0f
/** @defgroup can0_msr1_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


#define CAN0_MSR1_MTIMESTAMP_SHIFT		0
#define CAN0_MSR1_MTIMESTAMP_MASK		0xffff
/** @defgroup can0_msr1_mtimestamp MTIMESTAMP Timer value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mdl1 MDL1 Mailbox Data Low Register (MB = 1)
@{*/


#define CAN0_MDL1_MDL_SHIFT		0
#define CAN0_MDL1_MDL_MASK		0xffffffff
/** @defgroup can0_mdl1_mdl MDL Message Data Low Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mdh1 MDH1 Mailbox Data High Register (MB = 1)
@{*/


#define CAN0_MDH1_MDH_SHIFT		0
#define CAN0_MDH1_MDH_MASK		0xffffffff
/** @defgroup can0_mdh1_mdh MDH Message Data High Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mcr1 MCR1 Mailbox Control Register (MB = 1)
@{*/

/** CAN0_MCR1_MTCR Mailbox Transfer Command **/
#define CAN0_MCR1_MTCR		(1 << 23)
/** CAN0_MCR1_MACR Abort Request for Mailbox x **/
#define CAN0_MCR1_MACR		(1 << 22)
/** CAN0_MCR1_MRTR Mailbox Remote Transmission Request **/
#define CAN0_MCR1_MRTR		(1 << 20)

#define CAN0_MCR1_MDLC_SHIFT		16
#define CAN0_MCR1_MDLC_MASK		0x0f
/** @defgroup can0_mcr1_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mmr2 MMR2 Mailbox Mode Register (MB = 2)
@{*/


#define CAN0_MMR2_MOT_SHIFT		24
#define CAN0_MMR2_MOT_MASK		0x07
/** @defgroup can0_mmr2_mot MOT Mailbox Object Type
@{*/
/**@}*/


#define CAN0_MMR2_PRIOR_SHIFT		16
#define CAN0_MMR2_PRIOR_MASK		0x0f
/** @defgroup can0_mmr2_prior PRIOR Mailbox Priority
@{*/
/**@}*/


#define CAN0_MMR2_MTIMEMARK_SHIFT		0
#define CAN0_MMR2_MTIMEMARK_MASK		0xffff
/** @defgroup can0_mmr2_mtimemark MTIMEMARK Mailbox Timemark
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mam2 MAM2 Mailbox Acceptance Mask Register (MB = 2)
@{*/

/** CAN0_MAM2_MIDE Identifier Version **/
#define CAN0_MAM2_MIDE		(1 << 29)

#define CAN0_MAM2_MIDvA_SHIFT		18
#define CAN0_MAM2_MIDvA_MASK		0x7ff
/** @defgroup can0_mam2_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN0_MAM2_MIDvB_SHIFT		0
#define CAN0_MAM2_MIDvB_MASK		0x3ffff
/** @defgroup can0_mam2_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mid2 MID2 Mailbox ID Register (MB = 2)
@{*/

/** CAN0_MID2_MIDE Identifier Version **/
#define CAN0_MID2_MIDE		(1 << 29)

#define CAN0_MID2_MIDvA_SHIFT		18
#define CAN0_MID2_MIDvA_MASK		0x7ff
/** @defgroup can0_mid2_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN0_MID2_MIDvB_SHIFT		0
#define CAN0_MID2_MIDvB_MASK		0x3ffff
/** @defgroup can0_mid2_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mfid2 MFID2 Mailbox Family ID Register (MB = 2)
@{*/


#define CAN0_MFID2_MFID_SHIFT		0
#define CAN0_MFID2_MFID_MASK		0x1fffffff
/** @defgroup can0_mfid2_mfid MFID Family ID
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_msr2 MSR2 Mailbox Status Register (MB = 2)
@{*/

/** CAN0_MSR2_MMI Mailbox Message Ignored **/
#define CAN0_MSR2_MMI		(1 << 24)
/** CAN0_MSR2_MRDY Mailbox Ready **/
#define CAN0_MSR2_MRDY		(1 << 23)
/** CAN0_MSR2_MABT Mailbox Message Abort **/
#define CAN0_MSR2_MABT		(1 << 22)
/** CAN0_MSR2_MRTR Mailbox Remote Transmission Request **/
#define CAN0_MSR2_MRTR		(1 << 20)

#define CAN0_MSR2_MDLC_SHIFT		16
#define CAN0_MSR2_MDLC_MASK		0x0f
/** @defgroup can0_msr2_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


#define CAN0_MSR2_MTIMESTAMP_SHIFT		0
#define CAN0_MSR2_MTIMESTAMP_MASK		0xffff
/** @defgroup can0_msr2_mtimestamp MTIMESTAMP Timer value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mdl2 MDL2 Mailbox Data Low Register (MB = 2)
@{*/


#define CAN0_MDL2_MDL_SHIFT		0
#define CAN0_MDL2_MDL_MASK		0xffffffff
/** @defgroup can0_mdl2_mdl MDL Message Data Low Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mdh2 MDH2 Mailbox Data High Register (MB = 2)
@{*/


#define CAN0_MDH2_MDH_SHIFT		0
#define CAN0_MDH2_MDH_MASK		0xffffffff
/** @defgroup can0_mdh2_mdh MDH Message Data High Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mcr2 MCR2 Mailbox Control Register (MB = 2)
@{*/

/** CAN0_MCR2_MTCR Mailbox Transfer Command **/
#define CAN0_MCR2_MTCR		(1 << 23)
/** CAN0_MCR2_MACR Abort Request for Mailbox x **/
#define CAN0_MCR2_MACR		(1 << 22)
/** CAN0_MCR2_MRTR Mailbox Remote Transmission Request **/
#define CAN0_MCR2_MRTR		(1 << 20)

#define CAN0_MCR2_MDLC_SHIFT		16
#define CAN0_MCR2_MDLC_MASK		0x0f
/** @defgroup can0_mcr2_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mmr3 MMR3 Mailbox Mode Register (MB = 3)
@{*/


