grevaillot/svd_tools/headers/ATSAM3X8H/can0.h
#define CAN0_MMR3_MOT_SHIFT		24
#define CAN0_MMR3_MOT_MASK		0x07
/** @defgroup can0_mmr3_mot MOT Mailbox Object Type
@{*/
/**@}*/


#define CAN0_MMR3_PRIOR_SHIFT		16
#define CAN0_MMR3_PRIOR_MASK		0x0f
/** @defgroup can0_mmr3_prior PRIOR Mailbox Priority
@{*/
/**@}*/


#define CAN0_MMR3_MTIMEMARK_SHIFT		0
#define CAN0_MMR3_MTIMEMARK_MASK		0xffff
/** @defgroup can0_mmr3_mtimemark MTIMEMARK Mailbox Timemark
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mam3 MAM3 Mailbox Acceptance Mask Register (MB = 3)
@{*/

/** CAN0_MAM3_MIDE Identifier Version **/
#define CAN0_MAM3_MIDE		(1 << 29)

#define CAN0_MAM3_MIDvA_SHIFT		18
#define CAN0_MAM3_MIDvA_MASK		0x7ff
/** @defgroup can0_mam3_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN0_MAM3_MIDvB_SHIFT		0
#define CAN0_MAM3_MIDvB_MASK		0x3ffff
/** @defgroup can0_mam3_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mid3 MID3 Mailbox ID Register (MB = 3)
@{*/

/** CAN0_MID3_MIDE Identifier Version **/
#define CAN0_MID3_MIDE		(1 << 29)

#define CAN0_MID3_MIDvA_SHIFT		18
#define CAN0_MID3_MIDvA_MASK		0x7ff
/** @defgroup can0_mid3_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN0_MID3_MIDvB_SHIFT		0
#define CAN0_MID3_MIDvB_MASK		0x3ffff
/** @defgroup can0_mid3_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mfid3 MFID3 Mailbox Family ID Register (MB = 3)
@{*/


#define CAN0_MFID3_MFID_SHIFT		0
#define CAN0_MFID3_MFID_MASK		0x1fffffff
/** @defgroup can0_mfid3_mfid MFID Family ID
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_msr3 MSR3 Mailbox Status Register (MB = 3)
@{*/

/** CAN0_MSR3_MMI Mailbox Message Ignored **/
#define CAN0_MSR3_MMI		(1 << 24)
/** CAN0_MSR3_MRDY Mailbox Ready **/
#define CAN0_MSR3_MRDY		(1 << 23)
/** CAN0_MSR3_MABT Mailbox Message Abort **/
#define CAN0_MSR3_MABT		(1 << 22)
/** CAN0_MSR3_MRTR Mailbox Remote Transmission Request **/
#define CAN0_MSR3_MRTR		(1 << 20)

#define CAN0_MSR3_MDLC_SHIFT		16
#define CAN0_MSR3_MDLC_MASK		0x0f
/** @defgroup can0_msr3_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


#define CAN0_MSR3_MTIMESTAMP_SHIFT		0
#define CAN0_MSR3_MTIMESTAMP_MASK		0xffff
/** @defgroup can0_msr3_mtimestamp MTIMESTAMP Timer value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mdl3 MDL3 Mailbox Data Low Register (MB = 3)
@{*/


#define CAN0_MDL3_MDL_SHIFT		0
#define CAN0_MDL3_MDL_MASK		0xffffffff
/** @defgroup can0_mdl3_mdl MDL Message Data Low Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mdh3 MDH3 Mailbox Data High Register (MB = 3)
@{*/


#define CAN0_MDH3_MDH_SHIFT		0
#define CAN0_MDH3_MDH_MASK		0xffffffff
/** @defgroup can0_mdh3_mdh MDH Message Data High Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mcr3 MCR3 Mailbox Control Register (MB = 3)
@{*/

/** CAN0_MCR3_MTCR Mailbox Transfer Command **/
#define CAN0_MCR3_MTCR		(1 << 23)
/** CAN0_MCR3_MACR Abort Request for Mailbox x **/
#define CAN0_MCR3_MACR		(1 << 22)
/** CAN0_MCR3_MRTR Mailbox Remote Transmission Request **/
#define CAN0_MCR3_MRTR		(1 << 20)

#define CAN0_MCR3_MDLC_SHIFT		16
#define CAN0_MCR3_MDLC_MASK		0x0f
/** @defgroup can0_mcr3_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mmr4 MMR4 Mailbox Mode Register (MB = 4)
@{*/


#define CAN0_MMR4_MOT_SHIFT		24
#define CAN0_MMR4_MOT_MASK		0x07
/** @defgroup can0_mmr4_mot MOT Mailbox Object Type
@{*/
/**@}*/


#define CAN0_MMR4_PRIOR_SHIFT		16
#define CAN0_MMR4_PRIOR_MASK		0x0f
/** @defgroup can0_mmr4_prior PRIOR Mailbox Priority
@{*/
/**@}*/


#define CAN0_MMR4_MTIMEMARK_SHIFT		0
#define CAN0_MMR4_MTIMEMARK_MASK		0xffff
/** @defgroup can0_mmr4_mtimemark MTIMEMARK Mailbox Timemark
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mam4 MAM4 Mailbox Acceptance Mask Register (MB = 4)
@{*/

/** CAN0_MAM4_MIDE Identifier Version **/
#define CAN0_MAM4_MIDE		(1 << 29)

#define CAN0_MAM4_MIDvA_SHIFT		18
#define CAN0_MAM4_MIDvA_MASK		0x7ff
/** @defgroup can0_mam4_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN0_MAM4_MIDvB_SHIFT		0
#define CAN0_MAM4_MIDvB_MASK		0x3ffff
/** @defgroup can0_mam4_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mid4 MID4 Mailbox ID Register (MB = 4)
@{*/

/** CAN0_MID4_MIDE Identifier Version **/
#define CAN0_MID4_MIDE		(1 << 29)

#define CAN0_MID4_MIDvA_SHIFT		18
#define CAN0_MID4_MIDvA_MASK		0x7ff
/** @defgroup can0_mid4_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN0_MID4_MIDvB_SHIFT		0
#define CAN0_MID4_MIDvB_MASK		0x3ffff
/** @defgroup can0_mid4_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mfid4 MFID4 Mailbox Family ID Register (MB = 4)
@{*/


#define CAN0_MFID4_MFID_SHIFT		0
#define CAN0_MFID4_MFID_MASK		0x1fffffff
/** @defgroup can0_mfid4_mfid MFID Family ID
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_msr4 MSR4 Mailbox Status Register (MB = 4)
@{*/

/** CAN0_MSR4_MMI Mailbox Message Ignored **/
#define CAN0_MSR4_MMI		(1 << 24)
/** CAN0_MSR4_MRDY Mailbox Ready **/
#define CAN0_MSR4_MRDY		(1 << 23)
/** CAN0_MSR4_MABT Mailbox Message Abort **/
#define CAN0_MSR4_MABT		(1 << 22)
/** CAN0_MSR4_MRTR Mailbox Remote Transmission Request **/
#define CAN0_MSR4_MRTR		(1 << 20)

#define CAN0_MSR4_MDLC_SHIFT		16
#define CAN0_MSR4_MDLC_MASK		0x0f
/** @defgroup can0_msr4_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


#define CAN0_MSR4_MTIMESTAMP_SHIFT		0
#define CAN0_MSR4_MTIMESTAMP_MASK		0xffff
/** @defgroup can0_msr4_mtimestamp MTIMESTAMP Timer value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mdl4 MDL4 Mailbox Data Low Register (MB = 4)
@{*/


#define CAN0_MDL4_MDL_SHIFT		0
#define CAN0_MDL4_MDL_MASK		0xffffffff
/** @defgroup can0_mdl4_mdl MDL Message Data Low Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mdh4 MDH4 Mailbox Data High Register (MB = 4)
@{*/


#define CAN0_MDH4_MDH_SHIFT		0
#define CAN0_MDH4_MDH_MASK		0xffffffff
/** @defgroup can0_mdh4_mdh MDH Message Data High Value
@{*/
/**@}*/


/**@}*/

