grevaillot/svd_tools/headers/ATSAM3X8H/can0.h
/** @defgroup can0_mcr4 MCR4 Mailbox Control Register (MB = 4)
@{*/

/** CAN0_MCR4_MTCR Mailbox Transfer Command **/
#define CAN0_MCR4_MTCR		(1 << 23)
/** CAN0_MCR4_MACR Abort Request for Mailbox x **/
#define CAN0_MCR4_MACR		(1 << 22)
/** CAN0_MCR4_MRTR Mailbox Remote Transmission Request **/
#define CAN0_MCR4_MRTR		(1 << 20)

#define CAN0_MCR4_MDLC_SHIFT		16
#define CAN0_MCR4_MDLC_MASK		0x0f
/** @defgroup can0_mcr4_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mmr5 MMR5 Mailbox Mode Register (MB = 5)
@{*/


#define CAN0_MMR5_MOT_SHIFT		24
#define CAN0_MMR5_MOT_MASK		0x07
/** @defgroup can0_mmr5_mot MOT Mailbox Object Type
@{*/
/**@}*/


#define CAN0_MMR5_PRIOR_SHIFT		16
#define CAN0_MMR5_PRIOR_MASK		0x0f
/** @defgroup can0_mmr5_prior PRIOR Mailbox Priority
@{*/
/**@}*/


#define CAN0_MMR5_MTIMEMARK_SHIFT		0
#define CAN0_MMR5_MTIMEMARK_MASK		0xffff
/** @defgroup can0_mmr5_mtimemark MTIMEMARK Mailbox Timemark
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mam5 MAM5 Mailbox Acceptance Mask Register (MB = 5)
@{*/

/** CAN0_MAM5_MIDE Identifier Version **/
#define CAN0_MAM5_MIDE		(1 << 29)

#define CAN0_MAM5_MIDvA_SHIFT		18
#define CAN0_MAM5_MIDvA_MASK		0x7ff
/** @defgroup can0_mam5_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN0_MAM5_MIDvB_SHIFT		0
#define CAN0_MAM5_MIDvB_MASK		0x3ffff
/** @defgroup can0_mam5_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mid5 MID5 Mailbox ID Register (MB = 5)
@{*/

/** CAN0_MID5_MIDE Identifier Version **/
#define CAN0_MID5_MIDE		(1 << 29)

#define CAN0_MID5_MIDvA_SHIFT		18
#define CAN0_MID5_MIDvA_MASK		0x7ff
/** @defgroup can0_mid5_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN0_MID5_MIDvB_SHIFT		0
#define CAN0_MID5_MIDvB_MASK		0x3ffff
/** @defgroup can0_mid5_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mfid5 MFID5 Mailbox Family ID Register (MB = 5)
@{*/


#define CAN0_MFID5_MFID_SHIFT		0
#define CAN0_MFID5_MFID_MASK		0x1fffffff
/** @defgroup can0_mfid5_mfid MFID Family ID
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_msr5 MSR5 Mailbox Status Register (MB = 5)
@{*/

/** CAN0_MSR5_MMI Mailbox Message Ignored **/
#define CAN0_MSR5_MMI		(1 << 24)
/** CAN0_MSR5_MRDY Mailbox Ready **/
#define CAN0_MSR5_MRDY		(1 << 23)
/** CAN0_MSR5_MABT Mailbox Message Abort **/
#define CAN0_MSR5_MABT		(1 << 22)
/** CAN0_MSR5_MRTR Mailbox Remote Transmission Request **/
#define CAN0_MSR5_MRTR		(1 << 20)

#define CAN0_MSR5_MDLC_SHIFT		16
#define CAN0_MSR5_MDLC_MASK		0x0f
/** @defgroup can0_msr5_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


#define CAN0_MSR5_MTIMESTAMP_SHIFT		0
#define CAN0_MSR5_MTIMESTAMP_MASK		0xffff
/** @defgroup can0_msr5_mtimestamp MTIMESTAMP Timer value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mdl5 MDL5 Mailbox Data Low Register (MB = 5)
@{*/


#define CAN0_MDL5_MDL_SHIFT		0
#define CAN0_MDL5_MDL_MASK		0xffffffff
/** @defgroup can0_mdl5_mdl MDL Message Data Low Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mdh5 MDH5 Mailbox Data High Register (MB = 5)
@{*/


#define CAN0_MDH5_MDH_SHIFT		0
#define CAN0_MDH5_MDH_MASK		0xffffffff
/** @defgroup can0_mdh5_mdh MDH Message Data High Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mcr5 MCR5 Mailbox Control Register (MB = 5)
@{*/

/** CAN0_MCR5_MTCR Mailbox Transfer Command **/
#define CAN0_MCR5_MTCR		(1 << 23)
/** CAN0_MCR5_MACR Abort Request for Mailbox x **/
#define CAN0_MCR5_MACR		(1 << 22)
/** CAN0_MCR5_MRTR Mailbox Remote Transmission Request **/
#define CAN0_MCR5_MRTR		(1 << 20)

#define CAN0_MCR5_MDLC_SHIFT		16
#define CAN0_MCR5_MDLC_MASK		0x0f
/** @defgroup can0_mcr5_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mmr6 MMR6 Mailbox Mode Register (MB = 6)
@{*/


#define CAN0_MMR6_MOT_SHIFT		24
#define CAN0_MMR6_MOT_MASK		0x07
/** @defgroup can0_mmr6_mot MOT Mailbox Object Type
@{*/
/**@}*/


#define CAN0_MMR6_PRIOR_SHIFT		16
#define CAN0_MMR6_PRIOR_MASK		0x0f
/** @defgroup can0_mmr6_prior PRIOR Mailbox Priority
@{*/
/**@}*/


#define CAN0_MMR6_MTIMEMARK_SHIFT		0
#define CAN0_MMR6_MTIMEMARK_MASK		0xffff
/** @defgroup can0_mmr6_mtimemark MTIMEMARK Mailbox Timemark
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mam6 MAM6 Mailbox Acceptance Mask Register (MB = 6)
@{*/

/** CAN0_MAM6_MIDE Identifier Version **/
#define CAN0_MAM6_MIDE		(1 << 29)

#define CAN0_MAM6_MIDvA_SHIFT		18
#define CAN0_MAM6_MIDvA_MASK		0x7ff
/** @defgroup can0_mam6_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN0_MAM6_MIDvB_SHIFT		0
#define CAN0_MAM6_MIDvB_MASK		0x3ffff
/** @defgroup can0_mam6_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mid6 MID6 Mailbox ID Register (MB = 6)
@{*/

/** CAN0_MID6_MIDE Identifier Version **/
#define CAN0_MID6_MIDE		(1 << 29)

#define CAN0_MID6_MIDvA_SHIFT		18
#define CAN0_MID6_MIDvA_MASK		0x7ff
/** @defgroup can0_mid6_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN0_MID6_MIDvB_SHIFT		0
#define CAN0_MID6_MIDvB_MASK		0x3ffff
/** @defgroup can0_mid6_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mfid6 MFID6 Mailbox Family ID Register (MB = 6)
@{*/


#define CAN0_MFID6_MFID_SHIFT		0
#define CAN0_MFID6_MFID_MASK		0x1fffffff
/** @defgroup can0_mfid6_mfid MFID Family ID
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_msr6 MSR6 Mailbox Status Register (MB = 6)
@{*/

/** CAN0_MSR6_MMI Mailbox Message Ignored **/
#define CAN0_MSR6_MMI		(1 << 24)
/** CAN0_MSR6_MRDY Mailbox Ready **/
#define CAN0_MSR6_MRDY		(1 << 23)
/** CAN0_MSR6_MABT Mailbox Message Abort **/
#define CAN0_MSR6_MABT		(1 << 22)
/** CAN0_MSR6_MRTR Mailbox Remote Transmission Request **/
#define CAN0_MSR6_MRTR		(1 << 20)

#define CAN0_MSR6_MDLC_SHIFT		16
#define CAN0_MSR6_MDLC_MASK		0x0f
/** @defgroup can0_msr6_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


#define CAN0_MSR6_MTIMESTAMP_SHIFT		0
#define CAN0_MSR6_MTIMESTAMP_MASK		0xffff
/** @defgroup can0_msr6_mtimestamp MTIMESTAMP Timer value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mdl6 MDL6 Mailbox Data Low Register (MB = 6)
@{*/


#define CAN0_MDL6_MDL_SHIFT		0
#define CAN0_MDL6_MDL_MASK		0xffffffff
/** @defgroup can0_mdl6_mdl MDL Message Data Low Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mdh6 MDH6 Mailbox Data High Register (MB = 6)
@{*/


#define CAN0_MDH6_MDH_SHIFT		0
#define CAN0_MDH6_MDH_MASK		0xffffffff
/** @defgroup can0_mdh6_mdh MDH Message Data High Value
@{*/
/**@}*/


/**@}*/

