grevaillot/svd_tools/headers/ATSAM3X8H/can0.h
/** @defgroup can0_mcr6 MCR6 Mailbox Control Register (MB = 6)
@{*/

/** CAN0_MCR6_MTCR Mailbox Transfer Command **/
#define CAN0_MCR6_MTCR		(1 << 23)
/** CAN0_MCR6_MACR Abort Request for Mailbox x **/
#define CAN0_MCR6_MACR		(1 << 22)
/** CAN0_MCR6_MRTR Mailbox Remote Transmission Request **/
#define CAN0_MCR6_MRTR		(1 << 20)

#define CAN0_MCR6_MDLC_SHIFT		16
#define CAN0_MCR6_MDLC_MASK		0x0f
/** @defgroup can0_mcr6_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mmr7 MMR7 Mailbox Mode Register (MB = 7)
@{*/


#define CAN0_MMR7_MOT_SHIFT		24
#define CAN0_MMR7_MOT_MASK		0x07
/** @defgroup can0_mmr7_mot MOT Mailbox Object Type
@{*/
/**@}*/


#define CAN0_MMR7_PRIOR_SHIFT		16
#define CAN0_MMR7_PRIOR_MASK		0x0f
/** @defgroup can0_mmr7_prior PRIOR Mailbox Priority
@{*/
/**@}*/


#define CAN0_MMR7_MTIMEMARK_SHIFT		0
#define CAN0_MMR7_MTIMEMARK_MASK		0xffff
/** @defgroup can0_mmr7_mtimemark MTIMEMARK Mailbox Timemark
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mam7 MAM7 Mailbox Acceptance Mask Register (MB = 7)
@{*/

/** CAN0_MAM7_MIDE Identifier Version **/
#define CAN0_MAM7_MIDE		(1 << 29)

#define CAN0_MAM7_MIDvA_SHIFT		18
#define CAN0_MAM7_MIDvA_MASK		0x7ff
/** @defgroup can0_mam7_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN0_MAM7_MIDvB_SHIFT		0
#define CAN0_MAM7_MIDvB_MASK		0x3ffff
/** @defgroup can0_mam7_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mid7 MID7 Mailbox ID Register (MB = 7)
@{*/

/** CAN0_MID7_MIDE Identifier Version **/
#define CAN0_MID7_MIDE		(1 << 29)

#define CAN0_MID7_MIDvA_SHIFT		18
#define CAN0_MID7_MIDvA_MASK		0x7ff
/** @defgroup can0_mid7_midva MIDvA Identifier for standard frame mode
@{*/
/**@}*/


#define CAN0_MID7_MIDvB_SHIFT		0
#define CAN0_MID7_MIDvB_MASK		0x3ffff
/** @defgroup can0_mid7_midvb MIDvB Complementary bits for identifier in extended frame mode
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mfid7 MFID7 Mailbox Family ID Register (MB = 7)
@{*/


#define CAN0_MFID7_MFID_SHIFT		0
#define CAN0_MFID7_MFID_MASK		0x1fffffff
/** @defgroup can0_mfid7_mfid MFID Family ID
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_msr7 MSR7 Mailbox Status Register (MB = 7)
@{*/

/** CAN0_MSR7_MMI Mailbox Message Ignored **/
#define CAN0_MSR7_MMI		(1 << 24)
/** CAN0_MSR7_MRDY Mailbox Ready **/
#define CAN0_MSR7_MRDY		(1 << 23)
/** CAN0_MSR7_MABT Mailbox Message Abort **/
#define CAN0_MSR7_MABT		(1 << 22)
/** CAN0_MSR7_MRTR Mailbox Remote Transmission Request **/
#define CAN0_MSR7_MRTR		(1 << 20)

#define CAN0_MSR7_MDLC_SHIFT		16
#define CAN0_MSR7_MDLC_MASK		0x0f
/** @defgroup can0_msr7_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


#define CAN0_MSR7_MTIMESTAMP_SHIFT		0
#define CAN0_MSR7_MTIMESTAMP_MASK		0xffff
/** @defgroup can0_msr7_mtimestamp MTIMESTAMP Timer value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mdl7 MDL7 Mailbox Data Low Register (MB = 7)
@{*/


#define CAN0_MDL7_MDL_SHIFT		0
#define CAN0_MDL7_MDL_MASK		0xffffffff
/** @defgroup can0_mdl7_mdl MDL Message Data Low Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mdh7 MDH7 Mailbox Data High Register (MB = 7)
@{*/


#define CAN0_MDH7_MDH_SHIFT		0
#define CAN0_MDH7_MDH_MASK		0xffffffff
/** @defgroup can0_mdh7_mdh MDH Message Data High Value
@{*/
/**@}*/


/**@}*/

/** @defgroup can0_mcr7 MCR7 Mailbox Control Register (MB = 7)
@{*/

/** CAN0_MCR7_MTCR Mailbox Transfer Command **/
#define CAN0_MCR7_MTCR		(1 << 23)
/** CAN0_MCR7_MACR Abort Request for Mailbox x **/
#define CAN0_MCR7_MACR		(1 << 22)
/** CAN0_MCR7_MRTR Mailbox Remote Transmission Request **/
#define CAN0_MCR7_MRTR		(1 << 20)

#define CAN0_MCR7_MDLC_SHIFT		16
#define CAN0_MCR7_MDLC_MASK		0x0f
/** @defgroup can0_mcr7_mdlc MDLC Mailbox Data Length Code
@{*/
/**@}*/


/**@}*/
